# Panda

### diverses infos
* tools for reading and writing data
* data alignment and integrated handling of missing data
* the ability to perform arithmetic operations on the data
* easy reshaping and pivoting of data sets
* user-friendly operations for merging and joining data
* the ability to handle time series

### fonctions vues 
* The iloc operator allows us to slice both rows and columns using their position. The general syntax is as follows 
```python
df.iloc[rows, columns]
```

In [1]:
#import
import pandas as pd
import numpy as np

## 03. Series and DataFrames

In [2]:
## SERIES 
my_Series = pd.Series([1,'cat',10.2,'dog'])
my_Series
#0       1
#1     cat
#2    10.2
#3     dog

### POSSIBILITE DE CHANGER L'INDEX 

ages = pd.Series([20,53,68], index=['John', 'Allen', 'Mary'])
ages
#John     20
#Allen    53
#Mary     68
#dtype: int64
ages['John']

## DATAFRAMES

df = pd.DataFrame( {'user' : [1,2,3],
            'age' : [24,54,17],
            'sex' : ['F','F','M'],
            'occupation' : ['technician','musician','student']})
df.set_index('user')
#displaying the number of rows
df.shape[0]
#displaying the number of columns
df.shape[1]
#displaying the labels of all the columns
df.columns
#displaying the data types of each column
df.dtypes

df.describe()

df['occupation']

0    technician
1      musician
2       student
Name: occupation, dtype: object

## 05. Manipulating the data

In [3]:
df = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b', 'c'])
#df.drop(0, axis=0)
df.add(df.loc[0:1,:], fill_value=0)

df1= pd.DataFrame([['Mark', 50], ['Kate', 46]],
                 columns=['name', 'age'])
df2 = pd.DataFrame([['Jon', 3], ['David', 4]],
                columns=['name', 'age'])
pd.concat([df1,df2])

df3 = pd.DataFrame(['writer', 'journalist'], columns=['occupation'])
pd.concat([df1,df3], axis = 1)

   name  age  occupation
0  Mark   50      writer
1  Kate   46  journalist

## 06. Indexing, selecting and filtering

In [4]:
# We will work on a subset of the columns
columns = [
    'Mountain', 'Height (m)', 'Range', 'Coordinates', 'Parent mountain',
    'First ascent', 'Ascents bef. 2004', 'Failed attempts bef. 2004'
]
# Load the DataFrame, we will work on the first 10 rows (ten highest mountains)
df = pd.read_csv('data\Mountains.csv', nrows=10, usecols=columns)
df.set_index('Mountain', inplace=True)
df.Range
getattr(df, 'Height (m)')
df[df['Parent mountain'] == 'Mount Everest']

# Mountains with Mount Everest as parent with a first ascent after 1955
df[(df['Parent mountain'] == 'Mount Everest') & (df['First ascent'] > 1955)]

col_criteria = [True, False, False, False, True, True, False]
df.loc[df['Height (m)'] > 8000, col_criteria]

,Height (m),First ascent,Ascents bef. 2004
Mountain,,,
Mount Everest / Sagarmatha / Chomolungma,8848,1953,>>145
K2 / Qogir / Godwin Austen,8611,1954,45
Kangchenjunga,8586,1955,38
Lhotse,8516,1956,26
Makalu,8485,1955,45
Cho Oyu,8188,1954,79
Dhaulagiri I,8167,1960,51
Manaslu,8163,1956,49
Nanga Parbat,8126,1953,52
Annapurna I,8091,1950,36

## 07. Views vs copies

In [5]:
df = pd.DataFrame( {
    'user' : [1,2,3], 
    'age' : [24,54,17], 
    'sex' : ['F','F','M'], 
    'occupation' : ['technician','musician','student']
})
df2 = df.loc[df.sex=='F'].copy()
df2.loc[0:1,'sex']='Female'

## 08. Applying functions
* map()
* apply()
* applymap()

In [6]:
df = pd.DataFrame( {
    'user': [1, 2, 3],
    'age': [24, 54, 17],
    'sex': ['F', 'F', 'M'],
    'occupation': ['technician', 'musician', 'student']
})
# map : donne un dico, si connait pas le mot ==> NaN
df['sex'] = df['sex'].map({'F': 'Female', 'M': 'Male'})
#replace : remplace la valeur détectée ==> si connait pas le mot ==> valeur pas remplacée
df['sex'].replace('Female', '1')
# apply : applique une méthode de là à de là
df2 = pd.DataFrame(
    data=np.arange(9).reshape(3,3), columns=['a','b', 'c'])
df2.apply(sum, axis=0)
## applymap : applique une fonction et créer une vue (pas opti en terme d'éxécution)
def my_func(x):
    if x > 5:
        size = 'Large'
    elif x >3:
        size = 'Medium'
    else:
        size = 'Small'
    return size
df2.applymap(my_func)

       a       b       c
0  Small   Small   Small
1  Small  Medium  Medium
2  Large   Large   Large

## 09. Sorting

In [7]:
df = pd.DataFrame({'A':[3,6,1,12,3],'B':[0,0,7,5,6],'C':[10,4,5,8,2]})
df.sort_index(ascending=False, axis=1)
df.sort_values(['A','C'])

    A  B   C
2   1  7   5
4   3  6   2
0   3  0  10
1   6  0   4
3  12  5   8

## 10. Grouping

In [8]:
df = pd.DataFrame({
       'A' : ['dog', 'cat', 'dog', 'cat', 'dog', 'cat', 'dog', ra'dog'],
       'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
       'C' : np.random.randint(10, size=8)})

df.groupby('A')['C'].mean()

dfMusic = pd.read_csv('data\songs_requested.csv')
grouped_df = dfMusic.groupby('Musician').agg({'Name': 'count',
                                    'Decade': lambda x: str(min(x))+"-"+str(max(x)), 
                                    'Requested': ['sum', 'max', np.mean]}
                                    )
# renaming some columns
grouped_df.rename(columns={"count":"Total",
                           "<lambda>":"span"})

SyntaxError: invalid syntax (<ipython-input-8-c20d1acf2d08>, line 2)

## 11. Handling missing values

In [91]:
df = pd.DataFrame(np.random.randint(10, size=(3, 3)), index=['a', 'c', 'e'], columns=['A', 'B', 'C'])
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f'])
df2.isnull().sum() ## count null value of column
df2.isnull().sum(axis=1) ## count null value of row

## out null value
df2.dropna() 
# drop a row if it has a missing value in all of the columns
df2.dropna(how='all')
# drop a row if it has a missing value in column 'A'
df2.dropna(subset=['A'])
# drop a row if it has a missing value in column 'A' or column B
df2.dropna(subset=['A','B'])
# drop a row if it has a missing value in both column 'A' and column B
 df2.dropna(subset=['A','B'], how='all')
    
## put data on NaN
df2.fillna(value=0)

a    0
b    3
c    0
d    3
e    0
f    3
dtype: int64